# Python Data Wrangling Notes with Examples

## ðŸ”§ Setup

In [1]:
import pandas as pd 
import numpy as np

In [35]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, np.nan, 35, 45, 28],
    'Gender': ['F', 'M', 'M', 'M', 'F'],
    'City': ['Paris', 'London', np.nan, 'New York', 'Berlin'],
    'Income': [50000, 54000, 58000, 60000, np.nan]
}

df = pd.DataFrame(data)

## Handling Missing Data


### 1. Detect Missing Values

```python
df.isnull()
df.isnull().sum()
df.notnull()
```

In [ ]:
df.isnull() # Check for null values

    Name    Age  Gender   City  Income
0  False  False   False  False   False
1  False   True   False  False   False
2  False  False   False   True   False
3  False  False   False  False   False
4  False  False   False  False    True

In [4]:
df.isnull().sum() # Count the number of missing values in each column

Name      0
Age       1
Gender    0
City      1
Income    1
dtype: int64

In [5]:
df.notnull() # Check for non-null values

   Name    Age  Gender   City  Income
0  True   True    True   True    True
1  True  False    True   True    True
2  True   True    True  False    True
3  True   True    True   True    True
4  True   True    True   True   False

### 2. Drop Missing Values

<code>df.dropna()</code> does not modify the DataFrame unless inplace=True is set.

Syntax:

```python
DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
```

> `axis`: 0/'index' -> drop rows; 1/'columns' -> drop columns
> 
> `how`: 'any' -> drop if **any** NaN; 'all' -> drop if **all** NaN
> 
> `thresh`: Keep rows/columns with at least *thresh* non-NaN values
>
> `subset`: Only consider NaNs in specific columns or rows
>
> `inplace`: If True, modifies the original DataFrame; default is False

In [9]:
df.dropna(how='all') # Drop rows where all elements are NaN

      Name   Age Gender      City   Income
0    Alice  25.0      F     Paris  50000.0
1      Bob   NaN      M    London  54000.0
2  Charlie  35.0      M       NaN  58000.0
3    David  45.0      M  New York  60000.0
4      Eve  28.0      F    Berlin      NaN

### 3. Replace Missing Values

<code>df.fillna()</code>: Fill Missing (NaN) Values

```python
DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None)
```

|Parameter|Description|
|---------|-----------|
|value|Scalar, dict, Series, or DataFrame used to fill missing values|
|method|'ffill' (forward fill), 'bfill' (backward fill)|
|axis|0 to fill by row, 1 by column|
|inplace|If True, modifies the original DataFrame|
|limit|Max number of NaNs to fill along the axis|

In [13]:
df.fillna({
    'Age': df['Age'].mean(),
    'City': 'Unknown',
    'Income': df['Income'].mean()
}) # Fill NaN values with mean or a specific value

      Name    Age Gender      City   Income
0    Alice  25.00      F     Paris  50000.0
1      Bob  33.25      M    London  54000.0
2  Charlie  35.00      M   Unknown  58000.0
3    David  45.00      M  New York  60000.0
4      Eve  28.00      F    Berlin  55500.0

In [17]:
df.fillna(method='ffill') # Forward fill NaN values
# Same as LOCF (Last Observation Carried Forward)

/var/folders/sz/lvk4zx995bs6kc_jydg0r_y40000gn/T/ipykernel_41641/3220267720.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill') # Forward fill NaN values

      Name   Age Gender      City   Income
0    Alice  25.0      F     Paris  50000.0
1      Bob  25.0      M    London  54000.0
2  Charlie  35.0      M    London  58000.0
3    David  45.0      M  New York  60000.0
4      Eve  28.0      F    Berlin  60000.0

<code>df.replace()</code>: Replace Specific Values (NaN or Not)

```python
DataFrame.replace(to_replace=None, value=None, inplace=False, limit=None, regex=False)
```

|Parameter|Description|
|---------|-----------|
|to_replace|Value(s) to find (can be single value, list, dict, regex)|
|value|What to replace to_replace with|
|inplace|If True, modifies the original DataFrame|
|regex|Whether to interpret to_replace as a regular expression|

In [20]:
df1 = pd.DataFrame({
    'Status': ['yes', 'no', 'n/a', 'none', 'yes'],
    'Score': [1, 2, -999, np.nan, 3]
})

In [21]:
df1.replace(['n/a', 'none'], np.nan) # Replace specific values with NaN

  Status  Score
0    yes    1.0
1     no    2.0
2    NaN -999.0
3    NaN    NaN
4    yes    3.0

In [24]:
df1.replace({'Status': {'n/a': 'unknown', 'none': 'unknown'}}) # Replace specific values with another value

    Status  Score
0      yes    1.0
1       no    2.0
2  unknown -999.0
3  unknown    NaN
4      yes    3.0

In [29]:
df1.replace(to_replace='^n', value='no_', regex=True) # Replace values matching a regex pattern

# ^n matches any string starting with 'n'
# ^n.* matches any string starting with 'n' followed by any characters

   Status  Score
0     yes    1.0
1    no_o    2.0
2   no_/a -999.0
3  no_one    NaN
4     yes    3.0

#### Notes & Tips

- `fillna()` is **only for NaN** values.
- `replace()` can be used **for any value**, not just NaN.
- Always check inplace=True if you want to modify the original DataFrame.
- Use `df.isnull().sum()` to check for remaining NaNs.

## Data Type Conversion

Data type conversion is essential to ensure data is in the correct format for analysis and modeling.

Check Current Data Types using `df.dtypes`

- To integer/float: astype(int), astype(float)
- To datetime: pd.to_datetime()
- To category: astype('category')
- To string: astype(str)
- To boolean: astype(bool)

In [30]:
df2 = pd.DataFrame({
    'Age': ['25', '30', '40'],
    'JoinDate': ['2020-01-01', '2019-06-15', '2021-03-22']
})

df2['Age'] = df2['Age'].astype(int)
df2['JoinDate'] = pd.to_datetime(df2['JoinDate'])

print(df2.dtypes)

Age                  int64
JoinDate    datetime64[ns]
dtype: object

## Data Normalization & Standardization

Normalization and standardization help scale features to make machine learning algorithms perform better.

| Method           | Goal                         | Range         | When to Use                             |
|------------------|------------------------------|---------------|------------------------------------------|
| Normalization    | Rescale to [0, 1]            | [0, 1]        | When features have different scales      |
| Standardization  | Center to mean=0, std=1      | Mean=0, SD=1  | When data has Gaussian distribution      |

### MinMaxScaler

Transform features by scaling each feature to a given range, usually [0, 1].

It subtracts the minimum value and divides by the range (max - min) for each feature. 

`x_scaled = (x - x.min()) / (x.max() - x.min())`

This ensures that all features contribute equally to the distance calculations in algorithms like k-NN or gradient descent-based methods.

In [33]:
from sklearn.preprocessing import MinMaxScaler

In [ ]:
# min-max scaling
# Scale the 'Height' and 'Weight' columns to a range of [0, 1]
df3 = pd.DataFrame({
    'Height': [150, 160, 170, 175, 173, 165],
    'Weight': [60, 80, 100, 90, 85, 95]
})

scaler = MinMaxScaler()
df_scaled = pd.DataFrame(scaler.fit_transform(df3), columns=['Height', 'Weight'])

print(df_scaled)

   Height  Weight
0    0.00   0.000
1    0.40   0.500
2    0.80   1.000
3    1.00   0.750
4    0.92   0.625
5    0.60   0.875

#### Z-score Standardization (StandardScaler): 

Scales features to have a mean of 0 and a standard deviation of 1

`z = (x - mean) / std`

In [44]:
# Z-score Standardization (StandardScaler)
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
df_std = pd.DataFrame(scaler.fit_transform(df3), columns=['Height', 'Weight'])

print(df_std)

     Height    Weight
0 -1.815174 -1.936492
1 -0.644094 -0.387298
2  0.526986  1.161895
3  1.112526  0.387298
4  0.878310  0.000000
5 -0.058554  0.774597

#### MaxAbs Scaling: 

Scales each feature by its maximum absolute value

`x_scaled = x / max(|x|)`

In [43]:
# MaxAbsScaler example
# Scale the 'Height' and 'Weight' columns to the range [-1, 1]
from sklearn.preprocessing import MaxAbsScaler

scaler = MaxAbsScaler()
df_maxabs = pd.DataFrame(scaler.fit_transform(df3), columns=['Height', 'Weight'])

print(df_maxabs)

     Height  Weight
0  0.857143    0.60
1  0.914286    0.80
2  0.971429    1.00
3  1.000000    0.90
4  0.988571    0.85
5  0.942857    0.95

## Binning (Discretization)

**Binning** is the process of transforming continuous numerical variables into discrete categories.

- To reduce the effect of minor observation errors.
- To convert numerical data into categorical for modeling or visualization.
- To make models less sensitive to outliers.
- For grouped statistical analysis (e.g., age groups, income ranges).

##### Examples with `pd.cut`, `pd.qcut`, and custom bins:

In [ ]:
# Example 1: Categorical Encoding with pd.cut
# Create bins for the 'Age' column and label them
df4 = pd.DataFrame({'Age': [12, 22, 37, 45, 55, 67, 80]})

df4['AgeGroup'] = pd.cut(df4['Age'], bins=[0, 18, 35, 60, 100], 
                        labels=['Child', 'Young Adult', 'Adult', 'Senior'])

print(df4)

   Age     AgeGroup
0   12        Child
1   22  Young Adult
2   37        Adult
3   45        Adult
4   55        Adult
5   67       Senior
6   80       Senior

In [ ]:
# Example 2: Quantile-based Binning with pd.qcut
# Create quartiles for the 'Income' column and label them
df5 = pd.DataFrame({'Income': [25, 30, 35, 45, 55, 70, 100]})

df5['IncomeQuartile'] = pd.qcut(df5['Income'], q=4, labels=['Q1', 'Q2', 'Q3', 'Q4'])

print(df5)

   Income IncomeQuartile
0      25             Q1
1      30             Q1
2      35             Q2
3      45             Q2
4      55             Q3
5      70             Q4
6     100             Q4

In [49]:
# Example 3: Custom Manual Binning
def custom_binning(value):
    if value < 20:
        return 'Low'
    elif 20 <= value < 50:
        return 'Medium'
    else:
        return 'High'

df6 = pd.DataFrame({'Value': [10, 25, 40, 55, 70]})
df6['Binned'] = df6['Value'].apply(custom_binning)

print(df6)

   Value  Binned
0     10     Low
1     25  Medium
2     40  Medium
3     55    High
4     70    High

In [50]:
bins = [0, 20, 50, 100]
labels = ['Low', 'Medium', 'High']

df6['Level'] = pd.cut(df6['Value'], bins=bins, labels=labels)

print(df6)

   Value  Binned   Level
0     10     Low     Low
1     25  Medium  Medium
2     40  Medium  Medium
3     55    High    High
4     70    High    High

In [51]:
# Use .value_counts() to count occurrences of each bin
print(df6['Level'].value_counts())

Level
Medium    2
High      2
Low       1
Name: count, dtype: int64

## Indicator Variables (Dummy Variables)

**Indicator variables** are binary variables (0 or 1) that represent the presence of a specific category in a categorical variable.

Also known as:  
- Dummy variables  
- One-hot encoded variables

In [ ]:
# Example of One-Hot Encoding using pd.get_dummies
dummies = pd.get_dummies(df['Gender'], prefix='Gender')

df_combined = pd.concat([df, dummies], axis=1)

print(df_combined)

      Name   Age Gender      City   Income  Gender_F  Gender_M
0    Alice  25.0      F     Paris  50000.0      True     False
1      Bob   NaN      M    London  54000.0     False      True
2  Charlie  35.0      M       NaN  58000.0     False      True
3    David  45.0      M  New York  60000.0     False      True
4      Eve  28.0      F    Berlin      NaN      True     False

In [58]:
# Example of One-Hot Encoding using pd.get_dummies
dummies = pd.get_dummies(df6['Binned'], prefix='Binned', dtype='int')

df_combined = pd.concat([df6, dummies], axis=1)

print(df_combined)

   Value  Binned   Level  Binned_High  Binned_Low  Binned_Medium
0     10     Low     Low            0           1              0
1     25  Medium  Medium            0           0              1
2     40  Medium  Medium            0           0              1
3     55    High    High            1           0              0
4     70    High    High            1           0              0

# Thanks for reading!

#### Written by @hellorito